# Third-party taps (must be trusted by tasks/brewfile.yml first)
tap "koekeishiya/formulae"
tap "hashicorp/tap"

# CLI tools
brew "argocd"
brew "awscli"
brew "bat"
brew "bun"
brew "git"
brew "go"
brew "jq"
brew "neovim"
brew "nmap"
brew "nvm"
brew "pipx"
brew "powerlevel10k"
brew "pyenv"
brew "semgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "vim"
brew "virtualenv"

# Tools from trusted third-party taps
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Apps and fonts
cask "anki"
cask "claude"
cask "claude-code"
cask "datagrip"
cask "docker"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "goland"
cask "google-chrome"
cask "karabiner-elements"
cask "tailscale"
cask "telegram"
cask "vlc"
